Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_2.tmx
Source language: en
Languages: it

source: Tensioning devices for endless drive power transmissions [other than for land vehicles]
it: Dispositivi tensori per trasmissioni di potenza continua [non per veicoli terrestri]

source: Tensioning devices for endless drive power transmissions [parts of machines]
it: Dispositivi tensori per trasmissioni di potenza continua [parti di macchine]

source: Thermic torches (Gas operated -)
it: Cannelli termici (A gas -)

source: Butterfly valves (Non-metallic -) being parts of machines
it: Valvole a farfalla (Non metalliche -) che sono parti di macchine

source: Butterfly valves of metal being parts of machines
it: Valvole a farfalla in metallo che sono parti di macchine

source: Buttonholing machines
it: Macchine per fare asole

source: Cable cylinders [parts of machines]
it: Cilindri cavi [parti di macchine]

source: Cord making machines
it: Macchine per accordellare

source: Wire drawing machines
it: Trafilatrici [macchine]

source: Alternators
it: Alternatori

source: Milling machines [for metalworking]
it: Fresatrici [per la lavorazione dei metalli]

source: Machines for inflating balloons
it: Macchine per gonfiare palloni

source: Machines for inserting objects into balloons
it: Macchine per l'inserimento di oggetti in palloni

source: Combing machines
it: Pettinatrici

source: Turbine vanes, other than parts of land vehicle engines
it: Pale di turbina, non parti di motori di veicoli terrestri

source: Turrets with radially extending machine tools
it: Torrette con macchine utensili ad entensione radiale

source: Machine couplings and transmissions, except for land vehicles
it: Giunti e trasmissioni di macchine, non per veicoli terrestri

source: Electromechanical machines for chemical industry
it: Macchine elettromeccaniche per l'industria chimica

source: Linear transfer machines
it: Macchine a transfer lineare

source: Liquid aerators [machines]
it: Aeratori per liquidi [macchine]

source: Fuel economisers for motors and engines
it: Economizzatori di carburante per motori

source: Frictional drive components for machines
it: Componenti di trasmissione ad attrito per macchine

source: Furnace loading machines
it: Macchine per caricamento forni

source: Shredder machines for forage
it: Trinciatrici per foraggio

source: Silage spreaders [machines]
it: Spargi foraggio [macchine]

source: Single point cutting tools [machines]
it: Utensili monotaglienti [macchine]

source: Single point grease dispensers (Electric -)
it: Distributori di grasso continui (Elettrici -)

source: Magnetic positioners [parts of machines]
it: Posizionatori magnetici [parti di macchine]

source: Blanking presses
it: Presse da taglio

source: Emergency power generators
it: Gruppi elettrogeni di soccorso

source: Ball retrieving apparatus
it: Apparecchi per recupero sfere

source: Handles being parts of mechanically operated tools
it: Impugnature facenti parte di utensili meccanici

source: Head attachments for power tools
it: Testine attacco per utensili elettrici

source: Actuating mechanisms for controlling slats
it: Meccanismi di azionamento per il comando di stecche

source: Actuators for valves
it: Azionatori per valvole

source: Propellers for machines
it: Eliche per macchine

source: Rocker arms [parts of engines]
it: Leve oscillanti [parti di motori]

source: Gear changing mechanisms for machines
it: Meccanismi di cambio di velocità per macchine

source: Sorting machines [for chemical processing]
it: Dispositivi di cernita [per trattamento chimico]

source: Steam marine engines [not for land vehicles]
it: Motori marini a vapore [non per veicoli terrestri]

source: Distributor rotors [internal combustion engine parts]
it: Spazzole del distributore [parti di motore a combustione interna]

source: Pantograph controlled machines for engraving
it: Macchine per incidere a comando pantografico

source: Shearing machines for animals
it: Tosatrici per animali [macchine]

source: Power transmission belts for agricultural machines
it: Cinture di trasmissione per macchine agricole

source: Power transmission mechanisms [other than for land vehicles]
it: Meccanismi di trasmissione della potenza [non per veicoli terrestri]

source: Power transmissions [other than for land vehicles]
it: Trasmissioni della potenza [non per veicoli terrestri]

source: Lifting attachments incorporating mechanisms for the handling of goods
it: Meccanismi incorporati in accessori di sollevamento per la movimentazione di articoli

source: Tin openers, electric
it: Apriscatole elettrici

source: Shaft couplings [machines]
it: Giunti di alberi [macchine]

source: Drill chucks [parts of machines]
it: Porta-punte [parti di macchine]

source: Shaft bearings for vacuum pumps
it: Cuscinetti ad albero per pompe a vuoto

source: Shafts for pumps
it: Alberi delle pompe

source: Embossing printing machines
it: Macchine per goffrare

source: Cam sprockets, being engine timing components
it: Pignoni di camma, componenti di fasatura di motori

source: Sliders for knitting machines
it: Carrelli per macchine da maglieria

source: Platen printing machines
it: Macchine da stampa a platina

source: Plunger type valves for use with tanks
it: Valvole a stantuffi per uso con serbatoi

source: Pneumatic actuating apparatus
it: Apparecchi di azionamento pneumatici

source: Springs being parts of anti-vibration mountings for machines
it: Molle che sono parti di supporti antivibrazione per macchine

source: Air condensers [compressors]
it: Condensatori ad aria [compressori]

source: Diamond cutting tools for machines
it: Utensili da taglio diamantati per macchine

source: Cylinders for mills
it: Tamburi per mulini

source: Bearing brackets for ball bearings
it: Supporti per cuscinetti a sfera

source: Bearing brackets for roller bearings
it: Supporti per cuscinetti a rulli

source: Roller bearings
it: Cuscinetti a rulli

source: Die holders for use with machines
it: Portastampi per uso con macchine

source: Bookbinding apparatus and machines for industrial purposes
it: Apparecchi e macchine per la rilegatura per uso industriale

source: Bucket rails for conveyors
it: Rotaie per trasportatori

source: Rotary shoes [parts of machines]
it: Rotary shoe [parti di macchine]

source: Rotating electrical machines
it: Macchine elettriche rotanti

source: Screen printing machines
it: Stampatrici serigrafiche

source: Grating machines for vegetables
it: Macchine per grattuggiare le verdure

source: Lockable valves [parts of machines]
it: Valvole lucchettabili [parti di macchine]

source: Pneumatic controls for machines, motors and engines
it: Comandi pneumatici per macchine e motori

source: Screw grinding machines
it: Smerigliatrici per viti

source: Autogenous soldering machines
it: Macchine per saldatura autogena

source: Brakes for machines
it: Freni per macchine

source: Conveyors for agricultural and horticultural machinery and parts and fittings therefor
it: Traslatori per macchine agricole e orticole e relative parti ed accessori

source: Cyclone separators
it: Separatori a ciclone

source: Diesel engines for machines
it: Motori diesel per macchine

source: Cutterheads [parts of machines]
it: Teste portafresa [parti di macchine]

source: Paper feeders [printing]
it: Marginatori [stampa]

source: Shock absorbing springs being parts of machine suspension
it: Molle ammortizzatrici che sono parti di sospensioni di macchine

source: Precision screwdrivers (Electric -)
it: Cacciaviti di precisione (Elettrici -)

source: Pneumatically operated lifting jacks [machines]
it: Binde azionate pneumaticamente [macchine]

source: Machines for the preparation of foodstuffs [industrial]
it: Macchine per la preparazione di prodotti alimentari [industriali]

source: Staplers (Electric -), other than for office use
it: Pinzatrici (Elettriche -), non per ufficio

source: Road sweeping machines, self-propelled
it: Macchine spazzatrici automotrici

source: Power operated blowers
it: Soffianti elettriche

source: Printing presses for ceramic material
it: Presse da stampa per materiali ceramici

source: Exhaust gas treatment systems for diesel engines
it: Sistemi di trattamento dei gas di scarico per motori diesel

source: Filter presses
it: Filtropresse

source: Pedal drives for sewing machines
it: Comandi a pedale per macchine da cucire

source: Mud catchers and collectors [machines]
it: Collettori di fango [macchine]

source: Centrifugal pumps
it: Pompe centrifughe

source: Non-return valves of metal [parts of machines]
it: Valvole di non ritorno in metallo [parti di macchine]

source: Meat cutters [electric machines] for household use
it: Tagliacarne [macchine elettriche] per uso domestico

source: Mechanical shears [machines]
it: Cesoie meccaniche [macchine]

source: Abrasive discs [machine tools]
it: Dischi abrasivi [macchine utensili]

source: Cylinders being parts of machines
it: Cilindri che sono parti di macchine

source: Planetary gear transmissions, other than for land vehicles
it: Trasmissioni ad ingranaggi planetari, non per veicoli terrestri

source: Tube cutting instruments [machines]
it: Strumenti per tagliare i tubi [macchine]

source: Valves operated automatically by pneumatic control
it: Valvole azionate automaticamente mediante comando pneumatico

source: Assembly line conveyor machinery
it: Trasportatore per catena di montaggio

source: Crawler-tracked loaders
it: Caricatori cingolati

source: Grinding mills [for chemical processing]
it: Mulini macinatori [per trattamento chimico]

source: Embroidery machines
it: Macchine per ricamo

source: Bearings for shafts
it: Cuscinetti per alberi

source: Driving belts, other than for land vehicles
it: Cinghie di trasmissione, non per veicoli terrestri

source: Dynamo pulleys for vehicles
it: Pulegge per dinamo per veicoli

source: Pressure regulators [parts of machines]
it: Regolatori di pressione [parti di macchine]

source: Electric motors for use with doors
it: Motori elettrici per porte

source: Rubber stamps [parts of machines]
it: Timbri in gomma [parti di macchine]

source: Rubbish compactors [machines]
it: Compattatori per rifiuti [macchine]

source: Safety couplings [other than for land vehicles]
it: Giunti di sicurezza [non per veicoli terrestri]

source: Parquet wax-polishers, electric
it: Lucidatrici elettriche per parquet

source: Rotary drills [parts of machines]
it: Trivelle a rotazione [parti di macchine]

source: Laser cutting torches
it: Cannelli da taglio laser

source: Harrows [tractor towed agricultural implements]
it: Erpici [strumenti agricoli trainati da trattori]

source: Water pumps for showers
it: Pompe dell'acqua per docce

source: Articulated loaders
it: Caricatori articolati

source: Disc shaped rotating grinding tools [machines]
it: Utensili per molare rotanti a forma di disco [macchine]

source: Speed governers [mechanical] for machines, engines and motors
it: Regolatori di velocità [meccanici] per macchine e motori

source: Spindle hoists
it: Argani a fuso

source: Pivoting bucket elevators
it: Elevatori a tazze a perno

source: Door closers, electric
it: Chiudiporte elettrici

source: Rechargeable hedge cutters
it: Tosasiepi ricaricabili

source: Roller bearings for machines
it: Cuscinetti a rulli per macchine

source: Bending presses [machines]
it: Presse per piegatura [macchine]

source: Numerically controlled tapping machines
it: Maschiatrici a controllo numerico

source: Numerically positioned universal milling machines for tooling
it: Fresatrici universali a posizionamento numerico per lavorazione con utensili

source: Impact crushers [machines or parts of machines]
it: Frantumatori a urto [macchine o parti di macchine]

source: Steam boilers for steam generating [parts of machines]
it: Caldaie a vapore per generatori di vapore [parti di macchine]

source: Torque converters for machines
it: Convertitori di coppia per macchine

source: Towable agricultural machines
it: Macchine agricole rimorchiabili

source: Transferring machines
it: Macchine di trasferimento

source: Industrial robots for use in manufacture
it: Robot industriali per uso manifatturiero

source: Industrial robots for use in the handling of workpieces
it: Robot industriali per movimentazione di pezzi da lavorare

source: Suction fans for the carrying of grain
it: Aspiratori per il trasporto di granaglie

source: Suction machines for scavenging purposes
it: Macchine ad aspirazione per lavaggio

source: Moulds for die-casting [parts of machines]
it: Stampi per pressocolata [parti di macchine]

source: Moving coil servomotors
it: Servomotori a bobina mobile

source: Electrical vacuum cleaners for domestic use
it: Aspirapolvere elettrici per uso domestico

source: Sprayers [machines] for garden use in spraying insecticide
it: Nebulizzatori [macchine] per giardino per spruzzare insetticida

source: Perforating machines [for metalworking]
it: Perforatrici [per lavorazione dei metalli]

source: Couplings for agricultural implements
it: Accoppiamenti per strumenti agricoli

source: Power machines for cutting and splitting logs for firewood
it: Macchine per il taglio e la separazione dei ceppi di legna da ardere

source: Roller bearings [machine parts]
it: Cuscinetti a rulli [parti di macchine]

source: Wine presses [machines]
it: Torchi per l'uva [macchine]

source: Mechanical seals [machine parts]
it: Giunti meccanici [parti di macchine]

source: Jaw crushers [machines]
it: Frantoi a ganasce [macchine]

source: Stop valves [parts of machines]
it: Valvole di arresto [parti di macchine]

source: Welding machines for thermoplastic tubes
it: Macchine per la saldatura di tubi termoplastici

source: Automated machines for loading materials
it: Macchine automatizzate per il carico di materiali

source: Automatic cutting machines
it: Tagliatrici automatiche

source: Pumps for the extraction of vapour [machines]
it: Pompe per l'aspirazione del vapore [macchine]

source: Pumps for use in the food industry [machines]
it: Pompe per l'industria alimentare [macchine]

source: Machines for use in the sealing of cartons filled with food
it: Macchine per sigillare scatoloni di prodotti alimentari

source: Drive units, other than for land vehicles
it: Gruppi di traino, non per veicoli terrestri

source: Drives for converting rotary motion to linear motion [other than for land vehicles]
it: Comandi per convertire il movimento rotatorio in moto lineare [non per veicoli terrestri]

source: Heat sinks for use in machines
it: Dissipatori di calore per macchine

source: Condensers [ignition parts for internal combustion engines]
it: Condensatori [parti d'accensione per motori a combustione interna]

source: Pistons [internal combustion engine parts]
it: Pistoni [parti di motore a combustione interna]

source: Perforated drums being parts of machines for sorting materials
it: Fusti perforati che sono parti di macchine per la cernita di materiali

source: Permanent chucks [parts of machines]
it: Mandrini permanenti [parti di macchine]

source: Piercing machines
it: Macchine perforanti

source: Pressure vacuum pumps
it: Pompe a vuoto a pressione

source: Pressurising machines for drums
it: Macchine di pressurizzazione per fusti

source: Printing machines for fiduciary documents
it: Macchine per la stampa di documenti fiduciari

source: Exhaust bypasses
it: Bypass di scarico

source: Industrial brakes for industrial washing machines
it: Freni industriali per macchine lavatrici industriali

source: Fluid pumping installations
it: Sistemi di pompaggio per fluidi

source: Dough kneading machines (Electric -)
it: Macchine per impastare (Elettriche -)

source: Tap wrenches [machines]
it: Giramaschi [macchine]

source: Garlic presses (Electric -)
it: Spremiaglio (Elettrici -)

source: Electrical rotary converters
it: Convertitori rotanti elettrici

source: Electrical winches for sailboats
it: Verricelli elettrici per barche a vela

source: Uninterruptible power supply generating machines
it: Macchine di generazione di alimentazione senza interruzioni

source: Machines for manufacturing packaging materials
it: Macchine per la produzione di materiali da imballaggio

source: Cultivators [machines]
it: Coltivatori [macchine]

source: Single spindle tapping machines
it: Maschiatrici a fuso singolo

source: Slitting machines for industrial use
it: Macchine da taglio per uso industriale

source: Sludge cocks [valves] being parts of machines
it: Valvole per fanghi [valvole] che sono parti di macchine

source: Saw fences for use on table saws
it: Guide di appoggio per seghe da banco

source: Thrusters for machinery
it: Propulsori per macchinari

source: Stamping machines, other than for office use
it: Macchine stampigliatrici, non per ufficio

source: Radial feeders [machines]
it: Alimentatori radiali [macchine]

source: Ramjets [other than for land vehicles]
it: Autoreattori [non per veicoli terrestri]

source: Ramps being machines
it: Rampe che sono macchine

source: Workpiece locators [parts of machines]
it: Localizzatori dei pezzi [parti di macchine]

source: Tobacco processing machines
it: Macchine per lavorare il tabacco

source: Pump diaphragms
it: Membrane di pompe

source: Drive belts for driving aircraft
it: Cinghie di trasmissione per aerei

source: Sawing tools for use with sawing machines
it: Utensili per segare da usare con segatrici

source: Screen printing apparatus [machines]
it: Apparecchi per stampa serigrafica [macchine]

source: Mechanical spreaders
it: Spalmatrici meccaniche

source: Multi-purpose high pressure washers
it: Pulitrici multiuso ad alta pressione

source: Submersible electric pumps
it: Pompe elettriche sommergibili

source: Electric chain saws
it: Motoseghe elettriche

source: Bevelled edge formers [machines]
it: Formatori ad angolo tagliato [macchine]

source: Blade grinding machines
it: Macchine per molare lame

source: Vacuum accumulators for internal combustion engines
it: Accumulatori di vuoto per motori a scoppio

source: Notching machines
it: Macchine da intaglio

source: Numerically controlled drilling machines
it: Trapanatrici a controllo numerico

source: Machines for excavating rock
it: Macchine per scavare la roccia

source: Machines for filling packaging containers
it: Macchine per riempire contenitori per l'imballaggio

source: Spine binders [machines], other than for office use
it: Rilegatrici per dorsi [macchine], non per ufficio

source: Machines for applying beading to edges of mattresses
it: Macchine per applicare bordature su materassi

source: Gear hobbing machines
it: Dentatrici a creatore

source: Machines for peeling vegetables
it: Macchine per pelare ortaggi

source: Electrically powered windlasses
it: Verricelli ad azionamento elettrico

source: Mowing machines [petrol]
it: Falciatrici [a benzina]

source: Rollers being components of packaging lines [machines]
it: Rulli che sono componenti di linee d'imballaggio [macchine]

source: Discharge screws for liquid materials [parts of machines]
it: Viti di scarico per materie liquide [parti di macchine]

source: Discs made of abrasive materials [parts of machines]
it: Dischi in materiali abrasivi [parti di macchine]

source: Injectors for machines
it: Iniettori per macchine

source: Grating machines for household use
it: Macchine per grattugiare per uso domestico

source: Grease guns operated by compressed air
it: Pistole per ingrassaggio ad aria compressa

source: Grinders [machines]
it: Trituratrici [macchine]

source: Key making machines
it: Fresatrici per chiavi

source: Machines for the mechanical handling of items of post [industrial]
it: Macchine per la movimentazione meccanica di invii di corrispondenza [industriali]

source: Glaziers' diamonds being parts of machines
it: Tagliavetro diamantati come componenti di macchine

source: Food waste disposal machines
it: Trituratori di rifiuti alimentari

source: Forage harvesters [machines]
it: Caricaforaggio [macchine]

source: Spray lances being agricultural implements
it: Lance di spruzzo che sono attrezzi agricoli

source: Pressure intensifiers [machines]
it: Moltiplicatori di pressione [macchine]

source: Tile cutters [electric]
it: Tagliapiastrelle [elettrici]

source: Glass washing machines
it: Macchine per lavare i vetri

source: Gluing machines
it: Incollatrici

source: Rotary machines for ironing clothes
it: Macchine rotanti per stirare vestiti

source: Rotary milling cutters [parts of machines]
it: Frese rotanti [parti di macchine]

source: Rotary printing machines [other than for office use]
it: Macchine stampatrici a rotazione [non per ufficio]

source: Filters for hot gases for use with internal combustion engines
it: Filtri per i gas caldi da utilizzare nei motori a combustione interna

source: Wear plates for machines
it: Piastre di usura per macchine

source: Machines for manufacturing joints
it: Macchine per la produzione di giunti

source: Gas cutting machines
it: Macchine per ossitaglio

source: Gaskets for internal combustion engines
it: Guarnizioni per motori a combustione interna

source: Indexing drive machines
it: Meccanismi intermittori

source: Miniature screwdrivers (Electric -)
it: Cacciaviti in miniatura (Elettrici -)

source: Joints for tubes (metal -) [parts of machines]
it: Giunti per tubi (in metallo -) [parti di macchine]

source: Kneaders [electric kitchen machines]
it: Impastatori [macchine da cucina elettriche]

source: Elevators for materials
it: Elevatori per materiali

source: Excavators being moveable machines
it: Scavatrici che sono macchine mobili

source: Starters for motors and engines
it: Motorini d'avviamento per motori

source: Moving staircases [escalators]
it: Scale mobili [costruzione]

source: Wood chipping machines
it: Macchine cippatrici

source: Ploughs
it: Aratri

source: Transmission shafts, other than for land vehicles
it: Alberi di trasmissione non per veicoli terrestri

source: Mechanical and pneumatic hoisting apparatus
it: Apparecchi di sollevamento meccanici e pneumatici

source: Compressed air engines
it: Motori ad aria compressa

source: Turbine vanes being parts of gas turbine engines
it: Pale di turbine che sono parti di motori a turbina a gas

source: Turret lathes
it: Torni a torretta

source: Two-disc fertiliser spreaders
it: Spandiconcime a due dischi

source: Tyre pressing machines
it: Presse per pneumatici

source: Machine transmission components except for land vehicles
it: Componenti per trasmissioni per macchine eccetto veicoli terrestri

source: Reamers [parts of machines]
it: Alesatoi [parti di macchine]

source: Reciprocating feeders [machines]
it: Alimentatori alternativi [macchine]

source: Reciprocating feeders [parts of machines]
it: Alimentatori alternativi [parti di macchine]

source: Motorised fans for machines
it: Ventilatori a motore per macchine

source: Polishing discs [parts of machines]
it: Dischi per lucidare [parti di macchine]

source: Incubators for eggs
it: Incubatrici per uova

source: Sparking plugs for internal combustion engines
it: Candele di accensione per motori a scoppio

source: Friction wheels for machines
it: Ruote di di frizione per macchine

source: Cutting dies for use with machines
it: Stampi di tranciatura per macchine

source: Shredders [machines] for waste
it: Trituratori [macchine] per rifiuti

source: Single point cutting tools [parts for machines]
it: Utensili monotaglienti [parti di macchine]

source: Manifolds [parts of machines]
it: Collettori [parti di macchine]

source: Material compacting machines
it: Macchine compattatrici di materiali

source: Glaziers' diamonds [parts of machines]
it: Diamanti da vetraio [parti di macchine]

source: Flexographic printing machines
it: Macchine per stampa flessografica

source: Harvesting heads
it: Teste di raccolta

source: Adapters for machine tools
it: Adattatori per macchine utensili
